app/views/users/show.html.erb

      <div class="yjContainer">
        <%  current_user.reviews.each do |review| %>
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`user_id` = 1