app/controllers/reviews_controller.rb

  def create

    Review.create(create_params)
---
INSERT INTO `reviews` (`nickname`, `rate`, `review`, `product_id`, `created_at`, `updated_at`) VALUES ('', 1, 'hahahaha', 347, '2017-05-25 06:55:22', '2017-05-25 06:55:22')