app/views/products/index.html.erb

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 347
SELECT AVG(`reviews`.`rate`) FROM `reviews` WHERE `reviews`.`product_id` = 347
---
                      <p class="text-small">
                        <% if product.reviews.present? %>
                      <span class="rating-star">
                        <!-- <i class="star-actived rate-<%= product.reviews.average(:rate).round %>0"></i> -->